papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/beamInCrossFlow.Gillebaart2015/base/quasiMonolithic/constant/petscOptions.mf_asm_ilu
# Matrix-free Jacobian + Additive Schwarz with ILU(1) overlap
-snes_type newtonls
-snes_linesearch_type l2
-snes_rtol 1e-4
-snes_stol 1e-4
-snes_monitor
-snes_converged_reason

# Matrix-free Jacobian-vector products; assembled matrix for PC only
-snes_mf_operator

# Linear solver
-ksp_type lgmres
-ksp_gmres_restart 200
-ksp_rtol 1e-4
-ksp_converged_reason
-ksp_max_it 500

# Additive Schwarz with overlap, ILU(1) sub-blocks
-pc_type asm
-pc_asm_overlap 1
-sub_pc_type ilu
-sub_pc_factor_levels 1
