papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/beamInCrossFlow.Gillebaart2015/base/quasiMonolithic/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // Monlithic FSI system
    UpU
    {
        solver    petsc;

        options
        {
            // Nonlinear solver
            snes_type newtonls;
            snes_linesearch_type l2;
            snes_rtol "1e-5";
            snes_stol "1e-5";
            snes_monitor;
            snes_max_it "10";
            snes_converged_reason;

            // Matrix-free
            snes_mf;
            snes_mf_operator;

            snes_max_linear_solve_fail "10000000";
            snes_max_funcs "100000000";

            // Linear solver
            ksp_type fgmres;
            // ksp_type lgmres;
            ksp_gmres_restart "200";
            ksp_converged_reason;
            ksp_rtol "1e-2";
            ksp_pc_side right;
            ksp_max_it "100";

            // Preconditioner

            // Top-level (fluid-solid) preconditioner

            // We could just use LU and comment out all options after this point
            // pc_type lu;

            // A field-split preconditioner allows us to treat the fluid and
            // solid blocks differently
            pc_type fieldsplit;
            pc_fieldsplit_type schur;
            pc_fieldsplit_schur_fact_type lower;
            // pc_fieldsplit_schur_precondition selfp;
            pc_fieldsplit_schur_precondition a11;

            // Fluid block
            // We can also a second field-split level for the fluid to treat the
            // velocity and pressure blocks differently
            fieldsplit_fluid_ksp_type preonly;
            // fieldsplit_fluid_pc_type lu;
            fieldsplit_fluid_pc_type fieldsplit;
            fieldsplit_fluid_pc_fieldsplit_type schur;
            fieldsplit_fluid_pc_fieldsplit_schur_fact_type lower;
            // fieldsplit_fluid_pc_fieldsplit_schur_precondition selfp;
            fieldsplit_fluid_pc_fieldsplit_schur_precondition a11;

            // Fluid velocity equation
            fieldsplit_fluid_fieldsplit_velocity_ksp_type preonly;
            fieldsplit_fluid_fieldsplit_velocity_pc_type asm;
            fieldsplit_fluid_fieldsplit_velocity_sub_pc_type ilu;
            fieldsplit_fluid_fieldsplit_velocity_sub_pc_factor_levels "0";

            // Fluid pressure equation
            fieldsplit_fluid_fieldsplit_pressure_ksp_type preonly;

            fieldsplit_fluid_fieldsplit_pressure_pc_type hypre;
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_type boomeramg;
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_max_iter "1";
            // fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_strong_threshold "0.25";
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_strong_threshold "0.7";
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_grid_sweeps_up "1";
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_grid_sweeps_down "1";
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_agg_nl "1";
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_agg_num_paths "1";
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_max_levels "25";
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_coarsen_type HMIS;
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_interp_type ext+i;
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_P_max "1";
            fieldsplit_fluid_fieldsplit_pressure_pc_hypre_boomeramg_truncfactor "0.3";

            // Solid block
            fieldsplit_solid_ksp_type preonly;
            fieldsplit_solid_pc_type lu;

            // Lag the preconditioner
            // snes_lag_preconditioner "2";
            // snes_lag_preconditioner_persists;
            // snes_lag_jacobian "1";
        }
    }

    // fluid mesh motion
    D
    {
        solver    petsc;

        options
        {
            snes_type newtonls;
            snes_linesearch_type basic;
            snes_rtol "1e-6";
            snes_stol "1e-6";
            snes_max_it "100";
            snes_monitor;
            snes_converged_reason;

            snes_mf;
            snes_mf_operator;

            ksp_type lgmres;
            ksp_gmres_restart "100";
            ksp_converged_reason;

            pc_type bjacobi;
            sub_pc_type lu;

            snes_lag_preconditioner_persists true;
            snes_lag_preconditioner "-2";
        }
    }

    // Unused fluid solver
    // Still needs to be defined as petsc
    Up
    {
        solver    petsc;

        options
        {
        }
    }

    "p|pFinal"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
        maxIter         1000;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    cellMotionU
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
        maxIter         100;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        scaleCorrection true;
        directSolveCoarsest false;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "U|UFinal"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
        minIter         1;
    }
}

PIMPLE
{
    momentumPredictor   on;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;
}

// ************************************************************************* //
